---
kind: type
id: T:Autodesk.Revit.DB.Control
source: html/d04da6b9-0586-22b8-df13-8eb7f5ca248f.htm
---
# Autodesk.Revit.DB.Control

A control in Autodesk Revit family document.

## Syntax (C#)
```csharp
public class Control : Element
```

## Remarks
The object represents a variety of different shapes of controls in family document.
The different shapes of controls can handle the family instance in different ways.
 A vertical/horizontal arrow control rotates the instance by 180 degrees. A double vertical arrow control mirrors the instance geometry vertically. A double horizontal arrow control mirrors the instance geometry horizontally.